benchmarking/tsung-for-compose-environment.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="warning">

  <clients>
      <client host="localhost" maxusers="100" use_controller_vm="true" />
  </clients>

  <servers>
      <!-- Make requests via the proxy server -->
      <server host="127.0.0.1" port="3128" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="300" unit="second">
      <users arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>

  <options>
      <option type="ts_http" name="http_use_server_as_proxy" value="true">
          <user_agent probability="100">
          Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21
          </user_agent>
      </option>
  </options>

  <sessions>
    <session name="es_load" weight="1" type="ts_http">
      <request>
          <http url="http://core-management-layer:8000/users" method="GET" />
      </request>
      <request>
          <http url="http://core-management-layer:8000/domains" method="GET" />
      </request>
      <request>
          <http url="http://core-management-layer:8000/usersitedata" method="GET" />
      </request>
    </session>
  </sessions>
</tsung>