benchmarking/tsung.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="warning">

  <clients>
      <client host="localhost" maxusers="100" use_controller_vm="true" />
  </clients>

  <servers>
      <server host="management-layer.qa-hub.ie.gehosting.org" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="300" unit="second">
      <users arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="es_load" weight="1" type="ts_http">
      <request>
      <http url="/users" method="GET" />
      </request>
      <request>
      <http url="/domains" method="GET" />
      </request>
      <request>
      <http url="/usersitedata" method="GET" />
      </request>
    </session>
 </sessions>
</tsung>